## pandas
####  pandas use cases
* data Transformation
* data Analysis
* data cleaning
#### pandas Notations
* series---creating the data
* dataFrame----for making the data in a particular tabular foramat

In [3]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':30,'s3':20}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    30
s3    20
dtype: int64

In [5]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final

    Internal1  Internal2
s1         20         10
s2         10         30
s3         30         20

In [17]:
import pandas as pd

s1={'hari':30,'deepu':40,'keerthi':50,'siri':60}
s1=pd.Series(s1)
print(s1)
s2={'hari':40,'deepu':58,'keerthi':45,'siri':40}
s2=pd.Series(s2)
print(s2)

hari       30
deepu      40
keerthi    50
siri       60
dtype: int64
hari       40
deepu      58
keerthi    45
siri       40
dtype: int64

In [19]:
final={'s1':s1,'s2':s2}
final=pd.DataFrame(final)
final

         s1  s2
hari     30  40
deepu    40  58
keerthi  50  45
siri     60  40

In [20]:
final.columns

Index(['s1', 's2'], dtype='object')

In [21]:
final.values

array([[30, 40],
       [40, 58],
       [50, 45],
       [60, 40]], dtype=int64)

In [22]:
final.values[2,0]

50

In [23]:
final.values[0,0]

30

In [24]:
final.values[2]

array([50, 45], dtype=int64)

In [25]:
for i in final.values:
    print(i[0],i[1])

30 40
40 58
50 45
60 40

In [26]:
for i in final.values:
    print(i[0])

30
40
50
60

In [28]:
final.loc['devi']=[30,50]
final

         s1  s2
hari     30  40
deepu    40  58
keerthi  50  45
siri     60  40
s3       30  50
devi     30  50

In [29]:
final.drop('s3')

         s1  s2
hari     30  40
deepu    40  58
keerthi  50  45
siri     60  40
devi     30  50

In [31]:
final.values[3]=[30,40]
final

         s1  s2
hari     30  40
deepu    40  58
keerthi  50  45
siri     30  40
s3       30  50
devi     30  50

In [35]:
A = pd.DataFrame.from_dict({'Name':['A','A','B','B'],'marks':[1,1,2,1],'Credit':[3,1,3,2],'Grades':[10,12,10,20]})

A.groupby('Name').agg({'marks':'sum','Credit':'sum','Grades':'mean'})

      marks  Credit  Grades
Name
A         2       4      11
B         3       5      15

In [41]:
A=pd.DataFrame.from_dict({'name':['hari','hari','deepu','deepu'],'marks':[20,40,50,40],'average':[20,40,50,40]})
A.groupby('name').agg({'marks':'sum','average':'mean'})

       marks  average
name
deepu     90       45
hari      60       30

In [44]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [45]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [46]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [47]:
income.values[1,1]

'Alaska'

In [49]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [50]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933